/**
 * ## 地区附加配置
 * - 用于优化地图渲染或交互体验的，这是一个规范性配置，其作用取决于具体实现。
 * - 此处的配置应当都是可选的，避免强绑定可能带来的问题。
 * @todo 接入用户设置或订阅源
 */
export interface AreaAdditionalConfig {
  /**
   * ### 地区的中心位置
   * - 可用于在点位筛选器中选定地区后会使得视口自动定位到对应的坐标
   * - 该配置可以覆盖来自 dadian.json 订阅源中 `tiles[AREA_CODE].settings.center` 的配置
   * @注意 应当使用点位坐标而非地图坐标
   */
  target?: API.Coordinate2D

  /**
   * ### 地区的边界坐标点集
   * - 可用于打点时自动选择地区
   * @注意 应当使用点位坐标而非地图坐标
   * @todo 暂未实现
   */
  bounds?: API.Coordinate2D[]

  /**
   * ### 地区图标
   * - 可用于存档管理页显示地区图标
   * - 可以覆盖来自地区对象上 iconTag 字段的配置
   * - 当子级地区未指定时，会使用其父级地区的值
   */
  icon?: string

  /**
   * ### 地区标签
   * - 可用于在地图上显示文本标签
   */
  tags?: AreaTagTuple[]
}

/**
 * 地区文本标签配置
 * @note 使用元组而非对象是为了避免重复写 key
 */
export type AreaTagTuple = [
  /** 渲染内容 */
  text: string,

  /** 坐标表达式 */
  pos: API.Coordinate2D,

  /**
   * 字体级别
   * - `0` - 区级(即游戏内最小的名称)
   * - `1` - 块级(即游戏中显示统计探索度的名称)
   * - `2` - 国级(暂时没用上)
   * @default 0
   */
  level?: 0 | 1 | 2,
]

export const AREA_ADDITIONAL_CONFIG_MAP: Record<string, AreaAdditionalConfig> = {
  /** 蒙德 - 父级地区 */
  'C:MD': {
    icon: '/icons/area/蒙德.png',
  },
  /** 蒙德 */
  'A:MD:MENGDE': {
    tags: [
      ['明冠山地', [917, -4337], 1],
      ['苍风高地', [1260, -3553], 1],
      ['坠星山谷', [2295, -4122], 1],
      ['坠星山谷', [2295, -4122], 1],
      ['风啸山坡', [2323, -2880], 1],
      ['风龙废墟', [344, -4530]],
      ['明冠峡', [1096, -4498]],
      ['果酒湖', [1624, -4378]],
      ['望风山地', [2252, -4542]],
      ['望风角', [2872, -4726]],
      ['星落湖', [2304, -4294]],
      ['摘星崖', [2840, -4234]],
      ['千风神殿', [2808, -3894]],
      ['蒙德城', [1600, -4050]],
      ['低语森林', [2040, -4074]],
      ['奔狼领', [1080, -3678]],
      ['清泉镇', [1644, -3354]],
      ['风起地', [2172, -3470]],
      ['晨曦酒庄', [1100, -3200]],
      ['鹰翔海滩', [2860, -3182]],
      ['达达乌帕谷', [2616, -2650]],
      ['誓言岬', [3268, -2818]],
      ['马斯克礁', [4012, -2882]],
    ],
  },
  /** 蒙德 - 龙脊雪山 */
  'A:MD:XUESHAN': {
    icon: '/icons/area/龙脊雪山.png',
    tags: [
      ['龙脊雪山', [1506, -2470], 1],
      ['覆雪之路', [1896, -2674]],
      ['眠龙谷', [1456, -2562]],
      ['雪葬之都·近郊', [1200, -2200]],
      ['雪葬之都·旧宫', [1900, -2300]],
      ['寒天之钉', [1748, -2120]],
      ['星荧洞窟', [1588, -1950]],
    ],
  },

  /** 金苹果群岛 - 父级 */
  'C:APPLE': {
    icon: '/icons/area/金苹果群岛.png',
  },

  /** 璃月 - 父级 */
  'C:LY': {
    icon: '/icons/area/璃月.png',
  },
  /** 璃月 */
  'A:LY:LIYUE': {
    tags: [
      ['珉林', [-1500, -1429], 1],
      ['璃沙郊', [-864, 18], 1],
      ['云来海', [736, -199], 1],
      ['琼玑野', [482, -1531], 1],
      ['碧水原', [-205, -2507], 1],
      ['轻策庄', [-376, -3162]],
      ['无妄坡', [0, -2920]],
      ['石门', [240, -2778]],
      ['池中之盐', [680, -2494]],
      ['荻花洲', [50, -2386]],
      ['望舒客栈', [64, -1950]],
      ['明蕴镇', [876, -1854]],
      ['瑶光滩', [748, -1402]],
      ['归离原', [148, -1526]],
      ['孤云阁', [1452, -514]],
      ['翠玦坡', [-556, -1386]],
      ['渌华池', [-292, -1042]],
      ['遁玉陵', [-716, -518]],
      ['灵矩关', [-1020, -154]],
      ['天衡山', [-292, -158]],
      ['璃月港', [204, -198]],
      ['青墟浦', [-1220, 386]],
      ['奥藏山', [-1580, -2334]],
      ['华光林', [-1804, -2046]],
      ['庆云顶', [-1536, -1910]],
      ['绝云间', [-1080, -1754]],
      ['琥牢山', [-1964, -1754]],
      ['南天门', [-1760, -1362]],
      ['天遒谷', [-1130, -1026]],
    ],
  },
  /** 璃月 - 层岩 */
  'A:LY:CENGYAN': {
    icon: '/icons/area/层岩巨渊.png',
    tags: [
      ['层岩巨渊', [-1851, 128], 1],
      ['采樵谷', [-1608, -470]],
      ['伏鳌谷', [-1908, -134]],
      ['地面矿区', [-1896, 6]],
      ['巨渊之口', [-1950, 150]],
      ['丹砂崖', [-2244, 298]],
      ['天工峡', [-1960, 414]],
      ['琉璃峰', [-1500, 390]],
    ],
  },
  /** 璃月 - 沉玉谷 */
  'A:LY:CHENYUGU': {
    tags: [
      ['沉玉谷·上谷', [-2020, -3730], 1],
      ['遗龙埠', [-2734, -4106]],
      ['翘英庄', [-1497, -3884]],
      ['灵濛山', [-2176, -3816]],
      ['瞑垣山', [-2978, -3784]],
      ['宝玦口', [-2575, -3448]],
      ['沉玉谷·南陵', [-2211, -2781], 1],
      ['古茶树坡', [-1686, -3346]],
      ['药碟谷', [-1668, -2960]],
      ['赤璋城垣', [-2380, -2846]],
      ['悬练山', [-2062, -2337]],
    ],
  },

  /** 稻妻 - 父级 */
  'C:DQ': {
    icon: '/icons/area/稻妻.png',
  },
  /** 稻妻 - 1 */
  'A:DQ:1': {
    tags: [
      ['鸣神岛', [5920, 2760], 1],
      ['神无冢', [4690, 3620], 1],
      ['八酝岛', [3200, 4300], 1],
      ['刃连岛', [6116, 1646]],
      ['荒海', [6220, 2210]],
      ['离岛', [5588, 2506]],
      ['鸣神大社·神樱', [6450, 2454]],
      ['影向山', [6336, 2602]],
      ['神里屋敷', [6668, 2590]],
      ['绀田村', [5990, 2750]],
      ['镇守之森', [6456, 2858]],
      ['白狐之野', [6150, 3000]],
      ['甘金岛', [5820, 3130]],
      ['稻妻城', [6588, 3418]],
      ['九条阵屋', [5120, 3540]],
      ['踏鞴砂', [4650, 4178]],
      ['名椎滩', [4100, 3870]],
      ['藤兜砦', [3328, 4006]],
      ['无明砦', [2840, 4110]],
      ['无想刃狭间', [3608, 4054]],
      ['绯木村', [3384, 4200]],
      ['蛇神之首', [3520, 4362]],
      ['蛇骨矿洞', [3600, 4622]],
    ],
  },
  /** 稻妻 - 2 */
  'A:DQ:2': {
    tags: [
      ['海祈岛', [1580, 3900], 1],
      ['清籁岛', [5730, 5310], 1],
      ['水月池', [1960, 3942]],
      ['曚云神社', [1176, 4278]],
      ['珊瑚宫', [1544, 4222]],
      ['望泷村', [1648, 4470]],
      ['平海砦', [6372, 4858]],
      ['越石村', [5796, 5018]],
      ['「清籁丸」', [5500, 5050]],
      ['浅濑神社', [5400, 5542]],
      ['天云峠', [6200, 5450]],
    ],
  },
  /** 稻妻 - 鹤观 */
  'A:DQ:HEGUAN': {
    tags: [
      ['鹤观', [4100, 7530], 1],
      ['知比山', [3930, 7150]],
      ['笈名海滨', [4036, 7334]],
      ['千来神祠', [4376, 7286]],
      ['逢岳之野', [3900, 7580]],
      ['菅名山', [4100, 7600]],
      ['茂知祭场', [4230, 7674]],
      ['惑饲滩', [4192, 7854]],
    ],
  },

  /** 须弥 - 父级 */
  'C:XM': {
    icon: '/icons/area/须弥.png',
  },
  /** 须弥 - 诸法丛林 */
  'A:XM:FOREST': {
    tags: [
      ['善见地', [-3850, 901], 1],
      ['桓那兰那', [-4125, -581], 1],
      ['二净甸', [-3811, -221], 1],
      ['阿陀河谷', [-2897, 1305], 1],
      ['道成林', [-2965, 41], 1],
      ['护世森', [-2657, -1112], 1],
      ['无郁稠林', [-2500, -1228]],
      ['卡萨扎莱宫', [-2980, -930]],
      ['茸蕈窟', [-3250, -800]],
      ['桓那兰那', [-4086, -576]],
      ['须弥城', [-3154, -320]],
      ['香醉坡', [-2540, -280]],
      ['离渡谷', [-2850, -64]],
      ['天臂池', [-3300, -14]],
      ['化城郭', [-2748, 260]],
      ['维摩庄', [-3030, 642]],
      ['禅那园', [-3700, 620]],
      ['谒颂幽境', [-4300, 680]],
      ['降诸魔山', [-2660, 1050]],
      ['水天丛林', [-3850, 1304]],
      ['奥摩斯港', [-2850, 1770]],
      ['荼诃之座', [-4400, 1560]],
      ['觉王之殿', [-4280, 14]],
      ['往昔的桓那兰那', [-4700, 80]],
    ],
  },
  /** 须弥 - 大赤沙海 */
  'A:XM:DESERT': {
    icon: '/icons/area/须弥沙漠.png',
    tags: [
      ['列柱沙原', [-6826, 2371], 1],
      ['上风蚀地', [-5539, 3234], 1],
      ['下风蚀地', [-5282, 1557], 1],
      ['失落的苗圃', [-4656, 66], 1],
      ['圣显厅', [-5350, 1180]],
      ['喀万驿', [-4632, 1324]],
      ['饱饮之丘', [-6568, 1734]],
      ['阿如村', [-5046, 1816]],
      ['舍身陷坑', [-5500, 1986]],
      ['活力之家', [-4760, 2200]],
      ['赤王陵', [-6848, 2306]],
      ['丰饶绿洲', [-5860, 2500]],
      ['避让之丘', [-6420, 2992]],
      ['铄石之丘', [-7190, 2970]],
      ['荼诃落谷', [-5350, 3250]],
      ['秘仪圣殿', [-6100, 2314]],
    ],
  },
  /** 须弥 - 千壑沙地 */
  'A:XM:DESERT2': {
    icon: '/icons/area/须弥沙漠.png',
    tags: [
      ['千壑沙地', [-6489, 97], 1],
      ['「五绿洲」的孑遗', [-5600, -546]],
      ['「三运河之地」', [-6600, -200]],
      ['镔铁沙丘', [-5200, 0]],
      ['愚妄行宫', [-5800, 154]],
      ['折胫谷', [-7230, 16]],
      ['达马山', [-6590, 281]],
      ['啁哳之沙', [-5450, 326]],
      ['亡者狭廊', [-5900, 626]],
      ['巨人峡谷', [-6550, 870]],
      ['「神的棋盘」', [-6950, 1100]],
      ['塔尼特露营地', [-6200, 1150]],
    ],
  },
  /** 须弥 - 苍漠囿土 */
  'A:XM:DESERT3': {
    icon: '/icons/area/须弥沙漠.png',
    tags: [
      ['荒石苍漠', [-8162, -1428], 1],
      ['浮罗囿', [-7075, -1799], 1],
      ['荼泥黑渊', [-8074, -1523]],
      ['阻勒隘', [-8518, -1405]],
      ['铁穆山', [-7662, -1255]],
      ['甘露花海', [-7132, -1585]],
      ['锋刃林泽', [-7498, -1898]],
      ['跋松顶', [-7410, -2131]],
      ['聚香海岸', [-8268, -2228]],
    ],
  },

  /** 流形蜃境 */
  'C:VELURIYAM': {
    icon: '/icons/area/流形蜃境.png',
  },

  /** 枫丹 - 父级 */
  'C:FD': {
    icon: '/icons/area/枫丹.png',
  },
  /** 枫丹 - 枫丹廷区、白露区、苍晶区 */
  'A:FD:FENGDAN': {
    tags: [
      ['海露港', [-6093, -3138]],
      ['秋分山西侧', [-5041, -4244]],
      ['白淞镇', [-5166, -4493]],
      ['厄里那斯', [-6045, -4668]],
      ['枫丹廷', [-5521, -5537]],
      ['露景泉水', [-4248, -5492]],
      ['茉洁站', [-4528, -5826]],
      ['茉洁站', [-4528, -5826]],
      ['枫丹廷区', [-5097, -5593], 1],
      ['白露区', [-5180, -4130], 1],
      ['苍晶区', [-6009, -4210], 1],
    ],
  },
  /** 枫丹 - 枫丹动能工程科学研究院区、黎翡区 */
  'A:FD:FENGDAN2': {
    tags: [
      ['中央实验室遗址', [-4640, -7201]],
      ['新枫丹科学院', [-5177, -7230]],
      ['芒索斯山东麓', [-6084, -6588]],
      ['枫丹动能工程科学研究院区', [-4816, -7368], 1],
      ['黎翡区', [-5882, -6928], 1],
    ],
  },
  /** 枫丹 - 莫尔泰区、伊黎耶林区 */
  'A:FD:FENGDAN3': {
    tags: [
      ['秋分山东侧', [-4700, -4210]],
      ['卡布狄斯堡遗迹', [-3877, -4605]],
      ['柔灯港', [-3291, -5150]],
      ['幽灵雾道', [-3869, -5189]],
      ['欧庇克莱歌剧院', [-4518, -5296]],
      ['湖中垂柳', [-3716, -5907]],
      ['优兰尼娅湖', [-3968, -6195]],
      ['伊黎耶林区', [-4023, -5766], 1],
      ['莫尔泰区', [-4383, -4660], 1],
    ],
  },
  /** 枫丹 - 诺思托伊区 */
  'A:FD:FENGDAN4': {
    tags: [
      ['诺思托伊区', [-5130, -2292], 1],
    ],
  },
  /** 旧日之海 */
  'A:FD:ANCIENT_SEA': {
    tags: [],
  },

  /** 希穆兰卡 - 父级 */
  'C:SIMULANKA': {
    icon: '/icons/area/希穆兰卡.png',
  },

  'A:NT:NATA': {
    tags: [
      ['坚岩隘谷', [-10247, 1239], 1],
      ['踞石山', [-10098, 1924], 1],
      ['万火之瓯', [-11273, 1463], 1],
      ['踞石山', [-10098, 1924], 1],
      ['涌流地', [-11082, 2909], 1],
      ['紫薪之丘', [-11399, 973]],
      ['「回声之子」', [-9631, 1058]],
      ['硫晶支脉', [-10598, 1189]],
      ['隆崛坡', [-9925, 1422]],
      ['圣火竞技场', [-11560, 1542]],
      ['「悬木人」', [-10873, 2055]],
      ['祖遗庙宇', [-10103, 2059]],
      ['彩石顶', [-10589, 2213]],
      ['溶水域', [-11106, 2659]],
      ['「流泉之众」', [-11366, 2942]],
    ],
  },
}

/** 当 iconTag 为空时使用静态配置中的图标 */
export const fallbackToStaticIcon = ({ code, iconTag = '' }: API.AreaVo) => {
  if (iconTag)
    return iconTag
  const { 1: areaTag } = code!.split(':')
  const fallbackIcon = AREA_ADDITIONAL_CONFIG_MAP[code!]?.icon ?? AREA_ADDITIONAL_CONFIG_MAP[`C:${areaTag}`]?.icon
  return fallbackIcon ?? iconTag
}
